lictex/ArduinoCore-samd/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

fanctl_native.name=Fan Controller
fanctl_native.vid.0=0x2341
fanctl_native.pid.0=0x804d
fanctl_native.vid.1=0x2341
fanctl_native.pid.1=0x004d
fanctl_native.vid.2=0x2341
fanctl_native.pid.2=0x824d
fanctl_native.vid.3=0x2341
fanctl_native.pid.3=0x024d
fanctl_native.upload_port.0.vid=0x2341
fanctl_native.upload_port.0.pid=0x804d
fanctl_native.upload_port.1.vid=0x2341
fanctl_native.upload_port.1.pid=0x004d
fanctl_native.upload_port.2.vid=0x2341
fanctl_native.upload_port.2.pid=0x824d
fanctl_native.upload_port.3.vid=0x2341
fanctl_native.upload_port.3.pid=0x024d
fanctl_native.upload_port.4.board=fanctl_native

fanctl_native.upload.tool=bossac
fanctl_native.upload.tool.default=bossac
fanctl_native.upload.tool.network=arduino_ota
fanctl_native.upload.protocol=sam-ba
fanctl_native.upload.maximum_size=262144
fanctl_native.upload.maximum_data_size=32768
fanctl_native.upload.use_1200bps_touch=true
fanctl_native.upload.wait_for_upload_port=true
fanctl_native.upload.native_usb=true
fanctl_native.build.mcu=cortex-m0plus
fanctl_native.build.f_cpu=48000000L
fanctl_native.build.usb_product="Fan Controller"
fanctl_native.build.usb_manufacturer="oriental pyrotechnics"
fanctl_native.build.board=SAMD_ZERO
fanctl_native.build.core=arduino
fanctl_native.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
fanctl_native.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
fanctl_native.build.openocdscript=openocd_scripts/arduino_zero.cfg
fanctl_native.build.variant=arduino_zero
fanctl_native.build.variant_system_lib=
fanctl_native.build.vid=0x2341
fanctl_native.build.pid=0x804d
fanctl_native.bootloader.tool=openocd
fanctl_native.bootloader.tool.default=openocd
fanctl_native.bootloader.file=zero/samd21_sam_ba.bin

